import pandas  as pd
data = {
    'Возраст': [23, 22, 21, 27, 23, 20, 29, 28, 22, 25],
    'Зарплата': [54000, 56000, 58000, 60000, 62000, 64000, 66000, 68000, 70000, 72000]
}

df = pd.DataFrame(data)
print(f'Средний возраст: {df["Возраст"].mean()}')
print(f'Медиана возраста: {df["Возраст"].median()}')
print(f'Стандартное отклонение возраста: {df["Возраст"].std()}')

print(f'Средняя зарплата: {df["Зарплата"].mean()}')
print(f'Медиана зарплаты: {df["Зарплата"].median()}')
print(f'Стандартное отклонение зарплаты: {df["Зарплата"].std()}')


