import pandas as pd

data = {
    'name': ['Семенов Николай', 'Иванов Иван', 'Петров Петр', 'Самсонов Никитай', 'Максимов Артем', 'Петров Саша', 'Аммосов Вася', 'Хороршеев Самсон', 'Самсонов Тарас', 'Тарасов Степан'],
    'age': [23, 22, 21, 27, 23, 20, 29, 28, 22, 25],
    'math': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4],
    'physics': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4],
    'chemistry': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4],
    'biology': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4],
    'history': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4],
    'geography': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4],
    'literature': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4],
    'music': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4],
    'sport': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4],
    'english': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4],
    'russian': [4, 3, 4, 4, 5, 4, 3, 5, 4, 4]
}

df = pd.DataFrame(data)
print(df)

pr = df['']
print(f'Средний возраст: {df["age"].mean()}')
print(f'Медиана возраста: {df["age"].median()}')
print(f'Стандартное отклонение возраста: {df["age"].std()}')

print(f'Средняя оценка по математике: {df["math"].mean()}')
print(f'Медиана оценки по математике: {df["math"].median()}')
print(f'Стандартное отклонение оценки по математике: {df["math"].std()}')
